//
//  DetailText.swift
//  bamboo-iOS
//
//  Created by Ji-hoon Ahn on 2021/09/27.
//

import UIKit
//MARK: - detailString
enum ruleString : String{
    case rule = """
    제 1조 목적

    본 규칙은 광주소프트웨어마이스터고등학교 대나무숲 규칙으로, 대나무숲의 투명한 운영 및 익명성 보장을 목적으로 한다.


    제 2조 게시글 게시에 관한 규칙

    제 1항)  다음과 같은 게시물의 경우 반려 처리가 되거나, 삭제가 될 수 있다.

    1. 친목을 다지기 위한 게시글일 경우

    2. 홍보를 목적으로 하는 경우
        - 매우 개인적인 사항들로, 앱 추천인이나 게임 추천인 같은 경우
        - 많은 사람들에게 불편함을 안겨주는 홍보인 경우

    3. 특정 인물이나 단체를 지칭하거나 거론하는 경우
        - 지칭하거나 거론하여 비방하는 경우
        - 지칭하거나 거론하여 반복되는 게시글이 올라오는 경우

    4. 욕설 및 비속어를 포함하는 경우

    5. 공격적인 어조로 작성한 경우

    6. 거래, 설문조사, 분실물 회수 또는 구인/구직을 목적으로 하는 경우

    7. 정치/종교 등 논란을 불러일으킬 여지가 있는 경우

    8. 타 고등학교 또는 학교를 비방, 비난하는 경우

    9. 지나치게 길거나 지나치게 짧은 경우
        - 두페이지 정도를 잡아먹는 경우
        - 한문장도 완성시키지 못하는 경우

    10. 제보 반려 사유를 묻는 게시글일 경우

    11. 분란을 조장하는 경우

    12. 관리자의 판단 아래, 반절 이상의 관리자들이 문제가 있다고 판단한 경우

    제 2항) 제 2조 1항 2호에 해당하는 게시글이 공익을 목적으로 하는 고발성 제보일 경우, 관리자들의 회의 아래 게시될 수 있다. 단 다음 기준들이 엄격히 적용된다.

    1. 실명 거론의 경우 초성처리나 블라인드 처리로 수정된다.

    2. 육하원칙에 의거하여 작성되어있어야 한다.

    3. 추측성 내용이 포함되어있으면 안된다.

    4. 사실만 포함되어 있어야 한다.

    5. 비약적인 논리 전개가 있으면 안된다.

    제 3항) 이 외에 제 2조 1항의 기준에 해당되는 제보더라도, 논란의 소지가 없다고 판단되는 범위 내에서 대나무숲 활성화를 위해 관리자의 재량으로 게시글이 게시될 수 있다. 단, 다음 기준들이 적용된다.

    1. 홍보를 목적으로 하는 게시글일 경우, 디스코드 프로모션 서버를 통해 관리자에게 문의를 통해 사전 허가를 받아야 한다.

    2. 설문조사를 목적으로 하는 게시글일 경우, 디스코드 프로모션 서버를 통해 관리자에게 문의를 통해 사전 허가를 받아야 한다.


    제 3조 특정 이슈로 인한 과열에 관한 규칙

    제 1항) 특정 이슈로 대나무숲이 과열이 되는 조짐을 보일 경우, 관리자들의 자체적인 판단에 따라, 해당 주제에 관한 제보 업로드를 보류하는 시스템으로, 관리자의 판단 하에 공지 없이 시행될 수 있다.

    해당 이슈에 관한 글들은 일정 시간이 지난 이후에 하나의 게시글로 묶여 업로드 된다.
    """
}
